import binascii

p = 857504083339712752489993810777
q = 1029224947942998075080348647219 
c = 77578995801157823671636298847186723593814843845525223303932 
e = 65537

n = 882564595536224140639625987659416029426239230804614613279163

phi = (p - 1) * (q - 1) # just a formul 

d = pow(e, -1, phi) # pow - возводит в степень. e ** -1 % phi

m = pow(c, d, n) # c**d mod n

hex_str = hex(m)[2:] #переводит m в hex и убирает префикс т.е убирает 2 символа
if len(hex_str) % 2 != 0: # Если длина хекса не делится на 2, то к хексу в начале добавляется 0
    hex_str = '0' + hex_str
text = binascii.unhexlify(hex_str).decode('latin-1') # unhexlify переводит хекс в текст
print(hex(m))